     A*%%***********************************************************************
     A*%%TS  RD  20260818  064202  SREERAMC    REL-V7R5M0  5770-WDS
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A**************************************************************
     A* PPQHDRP - Protocol Report (letterhead/footer pattern shared
     A* by every RPTxxxP printer file - copy the PAGHDR/PAGFTR groups)
     A**************************************************************
     A*                                      PRTTYPE(*LINE)
     A*                                      PAGESIZE(66 132)
     A*                                      OVERFLOW(60)
     A*
     A          R PAGHDR
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                  1  2
     A                                      '<Company Logo>'
     A                                  1 40
     A                                      'PROCESS PERFORMANCE QUALIFICATION'
     A                                  1 70
     A                                      ' PROTOCOL'
     A*                                    DSPATR(HI)
     A                                  2 42
     A                                      '(Format 2 - Non-Sterile '
     A                                  2 64
     A                                      'Formulations)'
     A                                  3  2
     A                                      'Protocol No:'
     A            $H_PROTNO     20A     3 16
     A                                  3 60
     A                                      'Revision:'
     A            $H_REVNO       3S 0   3 70
     A                                  4  2
     A                                      'Product:'
     A            $H_PRODNM     80A     4 16
     A                                  5  2
     A                                      'Printed:'
     A            $H_PRTDT       6S 0   5 16
     A                                      EDTCDE(Y)
     A                                  5 60
     A                                      'Page'
     A            $PAGNBR        5S 0   5 68
     A                                      EDTCDE(Z)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R BODY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 002
     A*%%***********************************************************************
     A            $B_LABEL      30A     8  2
     A            $B_VALUE      80A     8 34
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A          R PAGFTR
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 051
     A*%%***********************************************************************
     A                                 60  2
     A                                      'CONFIDENTIAL - GxP '
     A                                 60 23
     A                                      'Controlled Document'
     A                                 60 90
     A                                      'Revision History '
     A                                 60107
     A                                      'maintained in PPQ_AUDIT'
     A                                 62  2
     A                                      'Author Signature:______________'
     A                                 62 35
     A                                      'Date:______'
     A                                 63  2
     A                                      'QA Signature:  ______________'
     A                                 63 35
     A                                      'Date:______'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 002
     A*%%CL 001
     A*%%***********************************************************************
