     A***************************************************************
     A* PPQNVRNMNT - DDS Physical File for PPQ_ENVIRONMENT
     A* Module 17 - Environmental Monitoring
     A***************************************************************
     A                                      UNIQUE
     A          R PPQNVRNMNR
     A            PROTOCOLID    18P 0
     A                                      ALIAS(PROTOCOL_ID)
     A            ENV_SEQ        4B 0
     A            ENV_CD        10A
     A            TEMP_MIN       5P 1
     A                                      ALWNULL
     A            TEMP_MAX       5P 1
     A                                      ALWNULL
     A            HMDTYMN        5P 1
     A                                      ALWNULL
     A                                      ALIAS(HUMIDITY_MIN)
     A            HMDTYMX        5P 1
     A                                      ALWNULL
     A                                      ALIAS(HUMIDITY_MAX)
     A            DFFPRSSR      20A
     A                                      VARLEN
     A                                      ALWNULL
     A                                      ALIAS(DIFF_PRESSURE)
     A            ROOM_CLASS    20A
     A                                      VARLEN
     A                                      ALWNULL
     A***************************************************************
     A          K PROTOCOLID
     A          K ENV_SEQ
