     A***************************************************************
     A* PPQPVNDR   - DDS Physical File for PPQ_API_VENDOR
     A* Module 10 - API Vendor Qualification
     A***************************************************************
     A                                      UNIQUE
     A          R PPQPVNDRR
     A            PROTOCOLID    18P 0
     A                                      ALIAS(PROTOCOL_ID)
     A            VENDOR_CD     15A
     A            QUALSTATUS     1A
     A                                      ALIAS(QUAL_STATUS)
     A            APPROVALDT      L
     A                                      ALWNULL
     A                                      ALIAS(APPROVAL_DT)
     A            EXPIRY_DT       L
     A                                      ALWNULL
     A***************************************************************
     A          K PROTOCOLID
     A          K VENDOR_CD
