     A*%%TS  SD  20260101  000000  EMPMOD      REL-V7R5M0  5770-WDS
     A*%%EC
     A*================================================================
     A*  LOGINDSPF  -  Login Screen Display File
     A*  Screen  : Login Screen (Section 5 - Login Screen)
     A*================================================================
     A                                      DSPSIZ(24 80 *DS3)
     A*----------------------------------------------------------------
     A*  LOGINSCR  -  Main Login Screen
     A*----------------------------------------------------------------
     A          R LOGINSCR
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                  1 24'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  1 65'DATE:'
     A                                      COLOR(WHT)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2 65'TIME:'
     A                                      COLOR(WHT)
     A                                  2 71TIME
     A                                  3 35'Sign On'
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                 20  3'IBM i 7.4'
     A                                      COLOR(BLU)
     A                                 10 15'User             :'
     A                                      COLOR(WHT)
     A                                 12 15'Password         :'
     A                                      COLOR(WHT)
     A            $EMPID         4S 0B 10 35
     A            $PWD          20A  B 12 35CHECK(LC)
     A                                      DSPATR(ND)
     A            MSG           70A  O 24  3COLOR(RED)
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 14'F12=Cancel'
     A                                      COLOR(BLU)
