     A*%%TS  SD  20260101  000000  EMPMOD      REL-V7R5M0  5770-WDS
     A*%%EC
     A*================================================================
     A*  MGREMPDT  -  Manager Employee Details Display File
     A*  Covers:
     A*    5.2.2  Employee Details (Subfile list of team members)
     A*    5.2.3  View Employee Detail (Full detail screen)
     A*================================================================
     A                                      DSPSIZ(24 80 *DS3)
     A*----------------------------------------------------------------
     A*  5.2.2  EMPDET  /  EMPDETCTL  -  Team Employee Subfile
     A*----------------------------------------------------------------
     A          R EMPDET                    SFL
     A            OPT            1S 0B 10  2
     A            $EMPIDED       4S 0O 10  6
     A            $EMPNAMED     20A  O 10 13
     A            $EMPTEAMED    10A  O 10 36
     A            $EMPDESED     20A  O 10 49
     A          R EMPDETCTL                 SFLCTL(EMPDET)
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF05(05 'Refresh')
     A                                      OVERLAY
     A  25                                  SFLDSP
     A  26                                  SFLDSPCTL
     A  27                                  SFLCLR
     A  28                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0010)
     A                                  1  3'USER: MANAGER'
     A                                      COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 32'Employee Details'
     A                                      COLOR(YLW)
     A                                  1 65'DATE:'
     A                                      COLOR(WHT)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2  3'TEAM:'
     A                                      COLOR(WHT)
     A            $MGRTEAM      10A  O  2  9COLOR(WHT)
     A                                  2 65'TIME:'
     A                                      COLOR(WHT)
     A                                  2 71TIME
     A                                  5  3'Type option, press Enter.'
     A                                      COLOR(BLU)
     A                                  6  5'5=View Details'
     A                                      COLOR(BLU)
     A                                  9  2'Opt'
     A                                      COLOR(WHT)
     A                                  9  7'ID'
     A                                      COLOR(WHT)
     A                                  9 13'Name'
     A                                      COLOR(WHT)
     A                                  9 36'Team'
     A                                      COLOR(WHT)
     A                                  9 49'Designation'
     A                                      COLOR(WHT)
     A          R FOOTER
     A                                      OVERLAY
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 13'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 28'F12=Cancel'
     A                                      COLOR(BLU)
     A            MSG           60A  O 24  3COLOR(RED)
     A*----------------------------------------------------------------
     A*  5.2.3  VIEWEMPDTL  -  View Full Employee Detail (Read-only)
     A*----------------------------------------------------------------
     A          R VIEWEMPDTL
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                  1  3'USER: MANAGER'
     A                                      COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 34'View Employee'
     A                                      COLOR(YLW)
     A                                  1 65'DATE:'
     A                                      COLOR(WHT)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2 65'TIME:'
     A                                      COLOR(WHT)
     A                                  2 71TIME
     A                                  5  3'Employee ID  :'
     A                                      COLOR(WHT)
     A                                  6  3'Name         :'
     A                                      COLOR(WHT)
     A                                  7  3'Gender       :'
     A                                      COLOR(WHT)
     A                                  7 42'City         :'
     A                                      COLOR(WHT)
     A                                  8  3'DOB          :'
     A                                      COLOR(WHT)
     A                                  8 42'DOJ          :'
     A                                      COLOR(WHT)
     A                                  9  3'Address      :'
     A                                      COLOR(WHT)
     A                                 10  3'Country      :'
     A                                      COLOR(WHT)
     A                                 10 42'Pin Code     :'
     A                                      COLOR(WHT)
     A                                 11  3'Team         :'
     A                                      COLOR(WHT)
     A                                 11 42'Project ID   :'
     A                                      COLOR(WHT)
     A                                 12  3'Designation  :'
     A                                      COLOR(WHT)
     A                                 12 42'Manager ID   :'
     A                                      COLOR(WHT)
     A                                 13  3'Mobile No.   :'
     A                                      COLOR(WHT)
     A                                 13 42'Alt No.      :'
     A                                      COLOR(WHT)
     A                                 14  3'Email Office :'
     A                                      COLOR(WHT)
     A                                 15  3'Email Personal:'
     A                                      COLOR(WHT)
     A                                 16  3'Status       :'
     A                                      COLOR(WHT)
     A                                 16 42'Role         :'
     A                                      COLOR(WHT)
     A            $VD_ID         4S 0O  5 20
     A            $VD_NAM       30A  O  6 20
     A            $VD_GND        1A  O  7 20
     A            $VD_CITY      20A  O  7 57
     A            $VD_DOB        8S 0O  8 20
     A            $VD_DOJ        8S 0O  8 57
     A            $VD_ADR       50A  O  9 20
     A            $VD_CTRY      20A  O 10 20
     A            $VD_PC         6S 0O 10 57
     A            $VD_TEAM      10A  O 11 20
     A            $VD_PRJID      6A  O 11 57
     A            $VD_DES       20A  O 12 20
     A            $VD_MGRID      4S 0O 12 57
     A            $VD_CON       10S 0O 13 20
     A            $VD_EMG       10S 0O 13 57
     A            $VD_EMLO      30A  O 14 20COLOR(BLU)
     A            $VD_EMLP      30A  O 15 21COLOR(BLU)
     A            $VD_STS        1A  O 16 20
     A            $VD_ROL        1A  O 16 57
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 14'F12=Cancel'
     A                                      COLOR(BLU)
