     A*%%TS  SD  20260101  000000  EMPMOD      REL-V7R5M0  5770-WDS
     A*%%EC
     A*================================================================
     A*  EMPCOMPD  - Employee Apply Comp-Off Display File
     A*  Covers:
     A*    5.3.2  Apply Comp-Off
     A*================================================================
     A                                      DSPSIZ(24 80 *DS3)
     A*----------------------------------------------------------------
     A*  5.3.2  APPLYCO  -  Apply Comp-Off Entry Screen
     A*----------------------------------------------------------------
     A          R APPLYCO
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF05(05 'Refresh')
     A                                      CF04(04 'Prompt')
     A                                      RTNCSRLOC(&P_REC &P_FLD)
     A            P_REC         10A  H
     A            P_FLD         10A  H
     A                                  1  3'USER:'
     A                                      COLOR(WHT)
     A            $USER         10A  O  1  9COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 33'Apply Comp Off'
     A                                      COLOR(YLW)
     A                                  1 65'DATE:'
     A                                      COLOR(WHT)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2  3'TEAM:'
     A                                      COLOR(WHT)
     A            $TEAM         10A  O  2  9COLOR(WHT)
     A                                  2 65'TIME:'
     A                                      COLOR(WHT)
     A                                  2 71TIME
     A                                  5  3'Worked Date  :'
     A                                      COLOR(WHT)
     A                                  5 50'(YYYYMMDD format)'
     A                                      COLOR(BLU)
     A                                  7  3'Day Type     :'
     A                                      COLOR(WHT)
     A                                  7 30'(F4=Prompt: FH/SH/FD)'
     A                                      COLOR(BLU)
     A                                  9  3'Reason       :'
     A                                      COLOR(WHT)
     A                                 11  3'Project Id   :'
     A                                      COLOR(WHT)
     A            $COWRDT        8S 0B  5 18
     A            $CODYTY        2A  B  7 18DSPATR(PR)
     A  61                                  DSPATR(PC)
     A  99                                  DSPATR(PR)
     A            $CORSN       100A  B  9 18CHECK(LC)
     A            $COPRJD        6A  B 11 18
     A            MSG           60A  O 24  3COLOR(RED)
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 13'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 28'F12=Cancel'
     A                                      COLOR(BLU)
     A                                 23 43'F4=Prompt DayType'
     A                                      COLOR(BLU)
