     A*%%TS  SD  20260101  000000  EMPMOD      REL-V7R5M0  5770-WDS
     A*%%EC
     A*================================================================
     A*  EMPDASH  - Employee Dashboard Display File
     A*  Covers:
     A*    5.3.1  Employee Main Dashboard
     A*    5.3.7  View Holidays  (Read-only subfile)
     A*    5.3.8  Change Password
     A*    N/A    Sign Out confirmation window
     A*================================================================
     A                                      DSPSIZ(24 80 *DS3)
     A*----------------------------------------------------------------
     A*  5.3.1  EMPMAIN  -  Employee Dashboard Menu
     A*----------------------------------------------------------------
     A          R EMPMAIN
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF05(05 'Refresh')
     A                                  1  3'USER:'
     A                                      COLOR(WHT)
     A            $USER         10A  O  1  9COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  1 65'DATE:'
     A                                      COLOR(WHT)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2  3'TEAM:'
     A                                      COLOR(WHT)
     A            $TEAM         10A  O  2  9COLOR(WHT)
     A                                  2 30'Employee Dashboard'
     A                                      COLOR(YLW)
     A                                      DSPATR(RI)
     A                                  2 65'TIME:'
     A                                      COLOR(WHT)
     A                                  2 71TIME
     A                                  6  2'Select one of the following.'
     A                                      COLOR(BLU)
     A                                  8  2'1: Apply Comp-offs'
     A                                  9  2'2: Apply Leaves'
     A                                 10  2'3: Leave Status'
     A                                 11  2'4: Comp-off Status'
     A                                 12  2'5: View Holidays'
     A                                 13  2'6: Change Password'
     A                                 15  2'7: Sign Off'
     A                                 20  2'Selection'
     A                                 21  2'===>'
     A            $SELECT        2Y 0B 21  8CHECK(RZ)
     A            MSG           60A  O 24  3COLOR(RED)
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 13'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 28'F12=Cancel'
     A                                      COLOR(BLU)
     A*----------------------------------------------------------------
     A*  5.3.7  View Holidays  -  SFL + SFLCTL  (Read-Only)
     A*----------------------------------------------------------------
     A          R MVHLDY                    SFL
     A            $HDATE         8S 0O  6  3
     A            $HDAY         10A  O  6 16
     A            $HRMRK        30A  O  6 30
     A          R MVHLDYCTL                 SFLCTL(MVHLDY)
     A                                      CF03(03 'Exit')
     A                                      CF05(05 'Refresh')
     A                                      CF12(12 'Cancel')
     A                                      OVERLAY
     A  20                                  SFLDSP
     A  21                                  SFLDSPCTL
     A  22                                  SFLCLR
     A  23                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0013)
     A                                  1  3'USER:'
     A                                      COLOR(WHT)
     A            $HUSER        10A  O  1  9COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 34'View Holidays'
     A                                      COLOR(YLW)
     A                                  1 65'DATE:'
     A                                      COLOR(WHT)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2 65'TIME:'
     A                                      COLOR(WHT)
     A                                  2 71TIME
     A                                  4  3'Date'
     A                                      COLOR(WHT)
     A                                  4 16'Day'
     A                                      COLOR(WHT)
     A                                  4 30'Remarks'
     A                                      COLOR(WHT)
     A          R MVHFOOTER
     A                                      OVERLAY
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 13'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 28'F12=Cancel'
     A                                      COLOR(BLU)
     A*----------------------------------------------------------------
     A*  5.3.8  Change Password
     A*----------------------------------------------------------------
     A          R CHGPWD
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                  1  3'USER:'
     A                                      COLOR(WHT)
     A            $CPUSER       10A  O  1  9COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 33'Change Password'
     A                                      COLOR(YLW)
     A                                  1 65'DATE:'
     A                                      COLOR(WHT)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2 65'TIME:'
     A                                      COLOR(WHT)
     A                                  2 71TIME
     A                                  9 10'User. . . . . . . . . . . . . .:'
     A                                      COLOR(WHT)
     A                                 11 10'Current password . . . . . . . :'
     A                                      COLOR(WHT)
     A                                 13 10'New password . . . . . . . . . :'
     A                                      COLOR(WHT)
     A                                 15 10'New password (to verify) . . . :'
     A                                      COLOR(WHT)
     A            $LOGEMPID      4S 0B  9 43
     A            $CURPWD       20A  B 11 43CHECK(LC)
     A            $NEWPWD       20A  B 13 43CHECK(LC)
     A            $NEWPWDV      20A  B 15 43CHECK(LC)
     A            MSG           60A  O 24  3COLOR(RED)
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 14'F12=Cancel'
     A                                      COLOR(BLU)
     A*----------------------------------------------------------------
     A*  Sign Out Confirmation Window
     A*----------------------------------------------------------------
     A          R SIGNOUT
     A                                      CF10(10 'Confirm')
     A                                      CF12(12 'Cancel')
     A                                      OVERLAY
     A                                      WINDOW(8 20 10 45)
     A                                  1 14'Signout Confirmation'
     A                                      COLOR(WHT)
     A                                  3  5'Are you sure you want to sign out?'
     A                                  9  5'F10=Confirm'
     A                                      COLOR(RED)
     A                                  9 29'F12=Cancel'
     A                                      COLOR(BLU)
