     A*%%TS  SD  20260101  000000  EMPMOD      REL-V7R5M0  5770-WDS
     A*%%EC
     A*================================================================
     A*  EMPLVED  - Employee Apply Leaves Display File
     A*  Covers:
     A*    5.3.3  Apply Leaves  (Leave type selection + balance display)
     A*    5.3.4  Apply Leave   (Date entry form)
     A*================================================================
     A                                      DSPSIZ(24 80 *DS3)
     A*----------------------------------------------------------------
     A*  5.3.3  APPLYSEL  - Leave Type Selection Screen
     A*         Shows current balances; employee selects type
     A*----------------------------------------------------------------
     A          R APPLYSEL
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF05(05 'Refresh')
     A                                  1  3'USER:'
     A                                      COLOR(WHT)
     A            $USER         10A  O  1  9COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 34'Apply Leaves'
     A                                      COLOR(YLW)
     A                                  1 65'DATE:'
     A                                      COLOR(WHT)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2  3'TEAM:'
     A                                      COLOR(WHT)
     A            $TEAM         10A  O  2  9COLOR(WHT)
     A                                  2 65'TIME:'
     A                                      COLOR(WHT)
     A                                  2 71TIME
     A                                  5  3'Select one of the following.'
     A                                      COLOR(BLU)
     A                                  7  5'1= Apply Casual Leave'
     A                                  8  5'2= Apply Earned Leave'
     A                                  9  5'3= Apply Comp Off Leave'
     A                                 12  3'Casual Leaves  :'
     A                                      COLOR(WHT)
     A            $BALCL         2S 0O 12 22COLOR(GRN)
     A                                 13  3'Earned Leaves  :'
     A                                      COLOR(WHT)
     A            $BALEL         2S 0O 13 22COLOR(GRN)
     A                                 14  3'Comp Off Leaves:'
     A                                      COLOR(WHT)
     A            $BALCO         2S 0O 14 22COLOR(GRN)
     A                                 17  2'Selection'
     A                                 18  2'===>'
     A            $SELVTYP       1Y 0B 18  8CHECK(RZ)
     A            MSG           60A  O 24  3COLOR(RED)
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 13'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 28'F12=Cancel'
     A                                      COLOR(BLU)
     A*----------------------------------------------------------------
     A*  5.3.4  APPLYFRM  - Leave Date Entry Form
     A*         Called after type is selected on APPLYSEL
     A*----------------------------------------------------------------
     A          R APPLYFRM
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF05(05 'Refresh')
     A                                      CF04(04 'Prompt')
     A                                      RTNCSRLOC(&P_REC &P_FLD)
     A            P_REC         10A  H
     A            P_FLD         10A  H
     A                                  1  3'USER:'
     A                                      COLOR(WHT)
     A            $FUSER        10A  O  1  9COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 34'Apply Leaves'
     A                                      COLOR(YLW)
     A                                  1 65'DATE:'
     A                                      COLOR(WHT)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2  3'TEAM:'
     A                                      COLOR(WHT)
     A            $FTEAM        10A  O  2  9COLOR(WHT)
     A                                  2 65'TIME:'
     A                                      COLOR(WHT)
     A                                  2 71TIME
     A                                  5  3'Leave Type    :'
     A                                      COLOR(WHT)
     A            $FLVTYP        2A  O  5 20COLOR(YLW)
     A                                  5 30'Balance:'
     A                                      COLOR(WHT)
     A            $FBAL          2S 0O  5 39COLOR(GRN)
     A                                  7  3'From Date     :'
     A                                      COLOR(WHT)
     A                                  7 35'(YYYYMMDD)'
     A                                      COLOR(BLU)
     A                                  8  3'From Day Type :'
     A                                      COLOR(WHT)
     A                                  8 35'(F4=Prompt: FH=First Half'
     A                                      COLOR(BLU)
     A                                  8 62'SH=Second Half FD=Full Day)'
     A                                      COLOR(BLU)
     A                                 10  3'To Date       :'
     A                                      COLOR(WHT)
     A                                 10 35'(YYYYMMDD)'
     A                                      COLOR(BLU)
     A                                 11  3'To Day Type   :'
     A                                      COLOR(WHT)
     A                                 11 35'(F4=Prompt)'
     A                                      COLOR(BLU)
     A                                 13  3'Reason        :'
     A                                      COLOR(WHT)
     A                                 15  3'Total Days    :'
     A                                      COLOR(WHT)
     A            $LVEFRDT       8S 0B  7 20
     A            $LVEFRDY       2A  B  8 20DSPATR(PR)
     A  71                                  DSPATR(PC)
     A  99                                  DSPATR(PR)
     A            $LVETODT       8S 0B 10 20
     A            $LVETODY       2A  B 11 20DSPATR(PR)
     A  72                                  DSPATR(PC)
     A  99                                  DSPATR(PR)
     A            $LVERSNY     100A  B 13 20CHECK(LC)
     A            $LVETDAY       2S 0O 15 20COLOR(YLW)
     A            MSG           60A  O 24  3COLOR(RED)
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 13'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 28'F12=Cancel'
     A                                      COLOR(BLU)
     A                                 23 43'F4=Prompt DayType'
     A                                      COLOR(BLU)
