     A*%%TS  SD  20260101  000000  EMPMOD      REL-V7R5M0  5770-WDS
     A*%%EC
     A*================================================================
     A*  EMPSTSD  - Employee Leave & Comp-Off Status Display File
     A*  Covers:
     A*    5.3.5  Leave Status   (Subfile – can cancel Pending)
     A*    5.3.6  Comp-Off Status (Subfile – can cancel Pending)
     A*================================================================
     A                                      DSPSIZ(24 80 *DS3)
     A*----------------------------------------------------------------
     A*  5.3.5  LVESTS_SFL  /  LVESTS_CTL  - Leave Status Subfile
     A*----------------------------------------------------------------
     A          R LVESTS_SFL                SFL
     A            SL_OPT         1S 0B  9  2
     A            SL_FRDT        8S 0O  9  7
     A            SL_TODT        8S 0O  9 19
     A            SL_TDAY        2S 0O  9 31
     A            SL_STS         1A  O  9 37
     A            SL_TYPE        2A  O  9 43
     A          R LVESTS_CTL                SFLCTL(LVESTS_SFL)
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF05(05 'Refresh')
     A                                      OVERLAY
     A  25                                  SFLDSP
     A  26                                  SFLDSPCTL
     A  27                                  SFLCLR
     A  28                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0011)
     A                                  1  3'USER:'
     A                                      COLOR(WHT)
     A            $LSUSER       10A  O  1  9COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 35'Leave Status'
     A                                      COLOR(YLW)
     A                                  1 65'DATE:'
     A                                      COLOR(WHT)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2  3'TEAM:'
     A                                      COLOR(WHT)
     A            $LSTEAM       10A  O  2  9COLOR(WHT)
     A                                  2 65'TIME:'
     A                                      COLOR(WHT)
     A                                  2 71TIME
     A                                  5  2'Press 1 to cancel the applied le+
     A                                      ave'
     A                                      COLOR(BLU)
     A                                  7  3'Opt'
     A                                      COLOR(WHT)
     A                                  7  8'From Date'
     A                                      COLOR(WHT)
     A                                  7 20'To Date'
     A                                      COLOR(WHT)
     A                                  7 30'Days'
     A                                      COLOR(WHT)
     A                                  7 36'Status'
     A                                      COLOR(WHT)
     A                                  7 43'Type'
     A                                      COLOR(WHT)
     A          R LS_FOOTER
     A                                      OVERLAY
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 13'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 28'F12=Cancel'
     A                                      COLOR(BLU)
     A            MSG           60A  O 24  3COLOR(RED)
     A*----------------------------------------------------------------
     A*  5.3.6  COSTS_SFL  /  COSTS_CTL  - Comp-Off Status Subfile
     A*----------------------------------------------------------------
     A          R COSTS_SFL                 SFL
     A            SC_OPT         1S 0B  9  2
     A            SC_WRDT        8S 0O  9  7
     A            SC_RSN        20A  O  9 19
     A            SC_DYTY        2A  O  9 42
     A            SC_STS         1A  O  9 49
     A          R COSTS_CTL                 SFLCTL(COSTS_SFL)
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF05(05 'Refresh')
     A                                      OVERLAY
     A  35                                  SFLDSP
     A  36                                  SFLDSPCTL
     A  37                                  SFLCLR
     A  38                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0011)
     A                                  1  3'USER:'
     A                                      COLOR(WHT)
     A            $CSUSER       10A  O  1  9COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 33'Comp Off Status'
     A                                      COLOR(YLW)
     A                                  1 65'DATE:'
     A                                      COLOR(WHT)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2  3'TEAM:'
     A                                      COLOR(WHT)
     A            $CSTEAM       10A  O  2  9COLOR(WHT)
     A                                  2 65'TIME:'
     A                                      COLOR(WHT)
     A                                  2 71TIME
     A                                  5  2'Press 1 to cancel the applied co+
     A                                      mp-off'
     A                                      COLOR(BLU)
     A                                  7  3'Opt'
     A                                      COLOR(WHT)
     A                                  7  8'Date'
     A                                      COLOR(WHT)
     A                                  7 19'Reason (Abbrev)'
     A                                      COLOR(WHT)
     A                                  7 41'DayType'
     A                                      COLOR(WHT)
     A                                  7 49'Status'
     A                                      COLOR(WHT)
     A          R CS_FOOTER
     A                                      OVERLAY
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 13'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 28'F12=Cancel'
     A                                      COLOR(BLU)
     A            MSG2          60A  O 24  3COLOR(RED)
