     A*%%TS  SD  20260119  062103  SREERAMC    REL-V7R5M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R ADMINRCD                  SFL
     A*%%TS  SD  20260116  122451  SREERAMC    REL-V7R5M0  5770-WDS
     A            OPT            1S 0B 11  3
     A            $EMPID         4S 0B 11  9
     A            $EMPNAM       30A  B 11 17
     A            $EMPCITY      20A  B 11 50
     A            $EMPROL        1A  B 11 73
     A          R ADMINCTL                  SFLCTL(ADMINRCD)
     A*%%TS  SD  20260116  122451  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF06(06 'Add Employee')
     A                                      CF07(07 'Add Holiday')
     A                                      CF08(08 'Refesh & reload')
     A                                      CF10(10 'View Holidays')
     A                                      OVERLAY
     A  25                                  SFLDSP
     A  26                                  SFLDSPCTL
     A  27                                  SFLCLR
     A  28                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0008)
     A                                  1  3'USER: ADMIN'
     A                                      COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  1 66'DATE:'
     A                                      COLOR(WHT)
     A                                  2 66'TIME:'
     A                                      COLOR(WHT)
     A                                  2 72TIME
     A                                  2 33'Admin Dashboard'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  6  2'Type option, press Enter.'
     A                                      COLOR(BLU)
     A                                  7  3'2=Update'
     A                                      COLOR(BLU)
     A                                  7 22'4=Delete'
     A                                      COLOR(BLU)
     A                                  7 42'5=Display'
     A                                      COLOR(BLU)
     A                                 10  3'OPT'
     A                                      COLOR(WHT)
     A                                 10 10'ID'
     A                                      COLOR(WHT)
     A                                 10 30'Name'
     A                                      COLOR(WHT)
     A                                 10 57'City'
     A                                      COLOR(WHT)
     A                                 10 72'Role'
     A                                      COLOR(WHT)
     A          R FOOTERA
     A*%%TS  SD  20260118  110243  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      OVERLAY
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 12'F12=Cancel'
     A                                      COLOR(BLU)
     A                                 23 26'F6=Add Employee'
     A                                      COLOR(BLU)
     A                                 23 44'F7=Add Holidays'
     A                                      COLOR(BLU)
     A                                 24  3'F10=View Holidays'
     A                                      COLOR(BLU)
     A          R ADDEMP
     A*%%TS  SD  20260116  070446  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF05(05 'Refresh')
     A                                      CF04(04 'PROMPT')
     A                                      RTNCSRLOC(&P_REC &P_FLD)
     A            P_REC         10A  H
     A            P_FLD         10A  H
     A                                  1  3'USER: ADMIN'
     A                                      COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 35'Add Employee'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 72TIME
     A                                  1 66'DATE:'
     A                                      COLOR(WHT)
     A                                  2 66'TIME:'
     A                                      COLOR(WHT)
     A                                  5  3'Type choices, press Enter.'
     A                                      COLOR(BLU)
     A                                  7  3'Employee ID:'
     A                                      COLOR(WHT)
     A                                  8  3'Name:'
     A                                      COLOR(WHT)
     A                                  9  3'Gender:'
     A                                      COLOR(WHT)
     A                                  9 54'City:'
     A                                      COLOR(WHT)
     A                                 10  3'DOB:'
     A                                      COLOR(WHT)
     A                                 10 54'DOJ:'
     A                                      COLOR(WHT)
     A                                 11  3'Address:'
     A                                      COLOR(WHT)
     A                                 12  3'Country:'
     A                                      COLOR(WHT)
     A                                 12 54'Pin Code:'
     A                                      COLOR(WHT)
     A                                 13  3'Team:'
     A                                      COLOR(WHT)
     A                                 13 54'Project id:'
     A                                      COLOR(WHT)
     A                                 14  3'Designation:'
     A                                      COLOR(WHT)
     A                                 14 54'Manager Id:'
     A                                      COLOR(WHT)
     A                                 15  3'Mobile No.:'
     A                                      COLOR(WHT)
     A                                 15 54'Alt Mobile No.:'
     A                                      COLOR(WHT)
     A                                 16  3'Email office:'
     A                                      COLOR(WHT)
     A                                 17  3'Email personal:'
     A                                      COLOR(WHT)
     A                                 18  3'Employee Status:'
     A                                      COLOR(WHT)
     A                                 18 55'Role:'
     A                                      COLOR(WHT)
     A                                 23  3'F3= Exit'
     A                                      COLOR(BLU)
     A                                 23 13'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 25'F12=Cancel'
     A                                      COLOR(BLU)
     A            MSG           40A  O 24  3COLOR(RED)
     A            $EMPID1        4S 0O  7 18
     A            $EMPNAM1      30A  B  8 18CHECK(LC)
     A            $EMPGND1       1A  B  9 18
     A  41                                  DSPATR(PC)
     A  99                                  DSPATR(PR)
     A            $EMPDOB1       8S 0B 10 18
     A            $EMPADR11     50A  B 11 18CHECK(LC)
     A            $EMPCTRY1     20A  B 12 18CHECK(LC)
     A            $EMPTEAM1     15A  B 13 18
     A  99                                  DSPATR(PR)
     A  42                                  DSPATR(PC)
     A            $EMPDES1      20A  B 14 18
     A            $EMPCON1      10S 0B 15 18
     A            $EMPEMLO1     30A  B 16 18CHECK(LC)
     A                                      COLOR(BLU)
     A            $EMPEMLP1     30A  B 17 19CHECK(LC)
     A                                      COLOR(BLU)
     A            $EMPSTS1       1A  B 18 20
     A  99                                  DSPATR(PR)
     A  43                                  DSPATR(PC)
     A            $EMPCITY1     20A  B  9 60CHECK(LC)
     A            $EMPDOJ1       8S 0B 10 60
     A            $EMPPC1        6S 0B 12 66
     A            $EMPPRJID1     6A  B 13 66
     A  45                                  DSPATR(PC)
     A  99                                  DSPATR(PR)
     A            $EMPMGRID1     4S 0B 14 66DSPATR(PR)
     A            $EMPEMG1      10S 0B 15 70
     A            $EMPROL1       1A  B 18 61
     A  99                                  DSPATR(PR)
     A  44                                  DSPATR(PC)
     A          R UPDATEEMP
     A*%%TS  SD  20260116  070446  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF05(05 'Refresh')
     A                                      CF04(04 'PROMPT')
     A                                      RTNCSRLOC(&P_REC &P_FLD)
     A            P_REC         10A  H
     A            P_FLD         10A  H
     A                                  1  3'USER: ADMIN'
     A                                      COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 72TIME
     A                                  1 66'DATE:'
     A                                      COLOR(WHT)
     A                                  2 66'TIME:'
     A                                      COLOR(WHT)
     A                                  5  3'Type choices, press Enter.'
     A                                      COLOR(BLU)
     A                                  7  3'Employee ID:'
     A                                      COLOR(WHT)
     A                                  8  3'Name:'
     A                                      COLOR(WHT)
     A                                  9  3'Gender:'
     A                                      COLOR(WHT)
     A                                  9 54'City:'
     A                                      COLOR(WHT)
     A                                 10  3'DOB:'
     A                                      COLOR(WHT)
     A                                 10 54'DOJ:'
     A                                      COLOR(WHT)
     A                                 11  3'Address:'
     A                                      COLOR(WHT)
     A                                 12  3'Country:'
     A                                      COLOR(WHT)
     A                                 12 54'Pin Code:'
     A                                      COLOR(WHT)
     A                                 13  3'Team:'
     A                                      COLOR(WHT)
     A                                 13 54'Project id:'
     A                                      COLOR(WHT)
     A                                 14  3'Designation:'
     A                                      COLOR(WHT)
     A                                 14 54'Manager Id:'
     A                                      COLOR(WHT)
     A                                 15  3'Mobile No.:'
     A                                      COLOR(WHT)
     A                                 15 54'Alt Mobile No.:'
     A                                      COLOR(WHT)
     A                                 16  3'Email office:'
     A                                      COLOR(WHT)
     A                                 17  3'Email personal:'
     A                                      COLOR(WHT)
     A                                 18  3'Employee Status:'
     A                                      COLOR(WHT)
     A                                 18 55'Role:'
     A                                      COLOR(WHT)
     A                                 23  3'F3= Exit'
     A                                      COLOR(BLU)
     A                                 23 13'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 25'F12=Cancel'
     A                                      COLOR(BLU)
     A            MSG           40A  O 24  3COLOR(RED)
     A            $EMPID2        4S 0B  7 18DSPATR(PR)
     A            $EMPNAM2      30A  B  8 18DSPATR(PR)
     A            $EMPGND2       1A  B  9 18DSPATR(PR)
     A            $EMPDOB2       8S 0B 10 18DSPATR(PR)
     A            $EMPADR12     50A  B 11 18
     A            $EMPCTRY2     20A  B 12 18
     A            $EMPTEAM2     15A  B 13 18
     A  46                                  DSPATR(PC)
     A  99                                  DSPATR(PR)
     A            $EMPDES2      20A  B 14 18
     A            $EMPCON2      10S 0B 15 18
     A            $EMPEMLO2     30A  B 16 18COLOR(BLU)
     A                                      CHECK(LC)
     A            $EMPEMLP2     30A  B 17 19COLOR(BLU)
     A                                      CHECK(LC)
     A            $EMPSTS2       1A  B 18 20
     A  47                                  DSPATR(PC)
     A  99                                  DSPATR(PR)
     A            $EMPCITY2     20A  B  9 60
     A            $EMPDOJ2       8S 0B 10 60
     A            $EMPPC2        6S 0B 12 66
     A            $EMPPRJID2     6A  B 13 66
     A  49                                  DSPATR(PC)
     A  99                                  DSPATR(PR)
     A            $EMPMGRID2     4S 0B 14 66
     A            $EMPEMG2      10S 0B 15 70
     A            $EMPROL2       1A  B 18 61
     A  48                                  DSPATR(PC)
     A  99                                  DSPATR(PR)
     A                                  2 36'Update Employee'
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A          R VIEWEMP
     A*%%TS  SD  20260116  070446  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A*                                     CF05(05 'Refresh')
     A                                  1  3'USER: ADMIN'
     A                                      COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 72TIME
     A                                  1 66'DATE:'
     A                                      COLOR(WHT)
     A                                  2 66'TIME:'
     A                                      COLOR(WHT)
     A                                  5  3'Type choices, press Enter.'
     A                                      COLOR(BLU)
     A                                  7  3'Employee ID:'
     A                                      COLOR(WHT)
     A                                  8  3'Name:'
     A                                      COLOR(WHT)
     A                                  9  3'Gender:'
     A                                      COLOR(WHT)
     A                                  9 54'City:'
     A                                      COLOR(WHT)
     A                                 10  3'DOB:'
     A                                      COLOR(WHT)
     A                                 10 54'DOJ:'
     A                                      COLOR(WHT)
     A                                 11  3'Address:'
     A                                      COLOR(WHT)
     A                                 12  3'Country:'
     A                                      COLOR(WHT)
     A                                 12 54'Pin Code:'
     A                                      COLOR(WHT)
     A                                 13  3'Team:'
     A                                      COLOR(WHT)
     A                                 13 54'Project id:'
     A                                      COLOR(WHT)
     A                                 14  3'Designation:'
     A                                      COLOR(WHT)
     A                                 14 54'Manager Id:'
     A                                      COLOR(WHT)
     A                                 15  3'Mobile No.:'
     A                                      COLOR(WHT)
     A                                 15 54'Alt Mobile No.:'
     A                                      COLOR(WHT)
     A                                 16  3'Email office:'
     A                                      COLOR(WHT)
     A                                 17  3'Email personal:'
     A                                      COLOR(WHT)
     A                                 18  3'Employee Status:'
     A                                      COLOR(WHT)
     A                                 18 55'Role:'
     A                                      COLOR(WHT)
     A                                 23  3'F3= Exit'
     A                                      COLOR(BLU)
     A                                 23 13'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 25'F12=Cancel'
     A                                      COLOR(BLU)
     A            MSG           40A  O 24  3COLOR(RED)
     A            $EMPID3        4S 0O  7 18
     A            $EMPNAM3      30A  O  8 18
     A            $EMPGND3       1A  O  9 18
     A            $EMPDOB3       8S 0O 10 18
     A            $EMPADR13     50A  O 11 18
     A            $EMPCTRY3     20A  O 12 18
     A            $EMPTEAM3     15A  O 13 18
     A            $EMPDES3      20A  O 14 18
     A            $EMPCON3      10S 0O 15 18
     A            $EMPEMLO3     30   O 16 18COLOR(BLU)
     A            $EMPEMLP3     30   O 17 19COLOR(BLU)
     A            $EMPSTS3       1A  O 18 20
     A            $EMPCITY3     20A  O  9 60
     A            $EMPDOJ3       8S 0O 10 60
     A            $EMPPC3        6S 0O 12 66
     A            $EMPPRJID3     6A  O 13 66
     A            $EMPMGRID3     4S 0O 14 66
     A            $EMPEMG3      10S 0O 15 70
     A            $EMPROL3       1A  O 18 61
     A                                  2 34'View Employee'
     A                                      COLOR(YLW)
     A          R ADDHOLDY
     A*%%TS  SD  20260119  062103  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF05(05 'Refresh')
     A                                      CF04(04 'PROMPT')
     A                                      RTNCSRLOC(&P_REC &P_FLD)
     A            P_REC         10A  H
     A            P_FLD         10A  H
     A                                  1  3'USER: Admin'
     A                                      COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 35'Add Holidays'
     A                                      COLOR(YLW)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 72TIME
     A                                  1 66'DATE:'
     A                                      COLOR(WHT)
     A                                  2 66'TIME:'
     A                                      COLOR(WHT)
     A                                  5  3'Date:'
     A                                      COLOR(WHT)
     A                                  6  3'Day:'
     A                                      COLOR(WHT)
     A                                  7  3'Remarks:'
     A                                      COLOR(WHT)
     A            MSG           40A  O 24  3COLOR(RED)
     A            $HLDATE1       8S 0B  5 12
     A            $HLDAY1       10A  B  6 12
     A  50                                  DSPATR(PC)
     A  99                                  DSPATR(PR)
     A            $HLRMRK1      20A  B  7 12
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 14'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 28'F12=Cancel'
     A                                      COLOR(BLU)
     A                                  6 29'(F4= Prompt)'
     A                                      COLOR(BLU)
     A          R VIEWHOLDY                 SFL
     A*%%TS  SD  20260117  060913  SREERAMC    REL-V7R5M0  5770-WDS
     A            OPT1           1  0B 10  5
     A            $HLDATE        8  0O 10 12
     A            $HLDAY        10   O 10 24
     A            $HLRMRK       20   O 10 38
     A          R VHOLDYCTL                 SFLCTL(VIEWHOLDY)
     A*%%TS  SD  20260117  060913  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF05(05 'Refresh')
     A                                      CF12(12 'Cancel')
     A                                      OVERLAY
     A  30                                  SFLDSP
     A  31                                  SFLDSPCTL
     A  32                                  SFLCLR
     A  33                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0012)
     A                                  1  3'USER: ADMIN'
     A                                      COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 34'View Holidays'
     A                                      COLOR(YLW)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  2 67'TIME:'
     A                                      COLOR(WHT)
     A                                  1 67'DATE:'
     A                                      COLOR(WHT)
     A                                  4  2'Type choices, press Enter.'
     A                                      COLOR(BLU)
     A                                  6  4'2=Update'
     A                                      COLOR(BLU)
     A                                  6 18'4= Delete'
     A                                      COLOR(BLU)
     A                                  9  5'opt'
     A                                      COLOR(WHT)
     A                                  9 14'Date'
     A                                      COLOR(WHT)
     A                                  9 24'Day'
     A                                      COLOR(WHT)
     A                                  9 42'Remarks'
     A                                      COLOR(WHT)
     A          R VHFOOTER
     A*%%TS  SD  20260117  060913  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      OVERLAY
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 13'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 27'F12=Cancel'
     A                                      COLOR(BLU)
     A          R UPDHOLDY
     A*%%TS  SD  20260119  061434  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF05(05 'Refresh')
     A                                      CF04(04 'PROMPT')
     A                                      RTNCSRLOC(&P_REC &P_FLD)
     A            P_REC         10A  H
     A            P_FLD         10A  H
     A                                  1  3'USER: Admin'
     A                                      COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 72TIME
     A                                  1 66'DATE:'
     A                                      COLOR(WHT)
     A                                  2 66'TIME:'
     A                                      COLOR(WHT)
     A                                  5  3'Date:'
     A                                      COLOR(WHT)
     A                                  6  3'Day:'
     A                                      COLOR(WHT)
     A                                  7  3'Remarks:'
     A                                      COLOR(WHT)
     A            $HLDATE2       8S 0B  5 12
     A            $HLDAY2       10A  B  6 12
     A  51                                  DSPATR(PC)
     A  99                                  DSPATR(PR)
     A            $HLRMRK2      20A  B  7 12
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 14'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 28'F12=Cancel'
     A                                      COLOR(BLU)
     A                                  6 29'(F4= Prompt)'
     A                                      COLOR(BLU)
     A                                  2 33'Update Holidays'
     A                                      COLOR(YLW)
     A            MSG           40   O 24  3COLOR(RED)
