     A*%%TS  SD  20260127  050926  SREERAMC    REL-V7R5M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R MGRMAIN
     A*%%TS  SD  20260127  050926  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF05(05 'Refresh')
     A                                  2  3'TEAM:'
     A                                      COLOR(WHT)
     A                                  3  3'TIME:'
     A                                      COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 32'Manager Dashboard'
     A                                      COLOR(YLW)
     A                                  1 66'DATE:'
     A                                      COLOR(WHT)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  3  9TIME
     A                                  6  2'Select one of the following.'
     A                                      COLOR(BLU)
     A                                  8  2'1: Employee Details'
     A                                  9  2'2: Approve or Deny Leaves'
     A                                 10  2'3: Approve/Deny Comp off'
     A                                 11  2'4: Apply Comp off'
     A                                 12  2'5: Apply Leaves'
     A                                 13  2'6: Leave Status'
     A                                 14  2'7: Comp Off Status'
     A                                 15  2'8: View Holidays'
     A                                 16  2'9: Change Password'
     A                                 18  2'10: Sign Off'
     A                                 20  2'Selection'
     A                                 21  2'===>'
     A                                 23  4'F3= Exit'
     A                                      COLOR(BLU)
     A                                 23 16'F5= Refresh'
     A                                      COLOR(BLU)
     A                                 23 31'F12= Cancel'
     A                                      COLOR(BLU)
     A                                  1  3'USER:'
     A                                      COLOR(WHT)
     A            $USER         10A  O  1  9
     A            $SELECT        2Y 0B 21  7CHECK(RZ)
     A            MSG           60   O 24  3COLOR(RED)
     A          R MVHLDY                    SFL
     A*%%TS  SD  20260121  102146  SREERAMC    REL-V7R5M0  5770-WDS
     A            $HDATE         8  0O  6  3
     A            $HDAY         10   O  6 14
     A            $HRMRK        30   O  6 28
     A          R MVHLDYCTL                 SFLCTL(MVHLDY)
     A*%%TS  SD  20260124  105900  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF05(05 'Refresh')
     A                                      CF12(12 'Cancel')
     A                                      OVERLAY
     A  20                                  SFLDSP
     A  21                                  SFLDSPCTL
     A  22                                  SFLCLR
     A  23                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0010)
     A                                  1  3'USER: MANAGER'
     A                                      COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 34'View Holidays'
     A                                      COLOR(YLW)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 72TIME
     A                                  1 66'DATE:'
     A                                      COLOR(WHT)
     A                                  2 66'TIME:'
     A                                      COLOR(WHT)
     A                                  5  5'Date'
     A                                      COLOR(WHT)
     A                                  5 17'Day'
     A                                      COLOR(WHT)
     A                                  5 39'Remarks'
     A                                      COLOR(WHT)
     A          R MVHFOOTER
     A*%%TS  SD  20260124  105900  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      OVERLAY
     A                                 23  4'F3= Exit'
     A                                      COLOR(BLU)
     A                                 23 16'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 30'F12= Cancel'
     A                                      COLOR(BLU)
     A          R CHGPWD
     A*%%TS  SD  20260124  124219  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      CF05(05 'Refresh')
     A                                  2  3'TEAM:'
     A                                      COLOR(WHT)
     A                                  2 66'TIME:'
     A                                      COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  1 66'DATE:'
     A                                      COLOR(WHT)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 72TIME
     A                                 23  4'F3= Exit'
     A                                      COLOR(BLU)
     A                                 23 15'F12= Cancel'
     A                                      COLOR(BLU)
     A                                  1  3'USER: MANAGER'
     A                                      COLOR(WHT)
     A                                  2 33'Change Password'
     A                                      COLOR(YLW)
     A                                  9 10'User.......................:'
     A                                      COLOR(WHT)
     A                                 11 10'Current password...........:'
     A                                      COLOR(WHT)
     A                                 13 10'New password...............:'
     A                                      COLOR(WHT)
     A                                 15 10'New password (to verify)...:'
     A                                      COLOR(WHT)
     A            $LOGEMPID      4S 0B  9 41
     A            $CURPWD       20A  B 11 41CHECK(LC)
     A            $NEWPWD       20A  B 13 41CHECK(LC)
     A            $NEWPWDV      20A  B 15 41CHECK(LC)
     A            MSG           60A  O 24  4COLOR(RED)
     A          R SIGNOUT
     A*%%TS  SD  20260127  024135  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      CF10(10 'Confirm')
     A                                      CF12(12 'Cancel')
     A                                      OVERLAY
     A                                      WINDOW(8 20 10 45)
     A                                  1 14'Signout Confirmation'
     A                                      COLOR(WHT)
     A                                  3  7'Are you sure you want to signout?'
     A                                  9  5'F10=Confirm'
     A                                      COLOR(RED)
     A                                  9 29'F12=Cancel'
     A                                      COLOR(BLU)
