     A*%%TS  SD  20260128  172319  SREERAMC    REL-V7R5M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R ARVLVE                    SFL
     A*%%TS  SD  20260128  055810  SREERAMC    REL-V7R5M0  5770-WDS
     A            OPT            1S 0B  9  3
     A            $EMPID         4S 0O  9  7
     A            $LVEFRDT       8S 0O  9 35
     A            $LVETODT       8S 0O  9 45
     A            $LVETDAY       2S 0O  9 59
     A            $LVESTS        1A  O  9 75
     A            $EMPNAM       20   O  9 13
     A            $LVECLTY       2   O  9 67
     A          R ARVLVECTL                 SFLCTL(ARVLVE)
     A*%%TS  SD  20260128  055810  SREERAMC    REL-V7R5M0  5770-WDS
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0010)
     A                                      CF03(03 'Exit')
     A                                      CF12(12 'Cancel')
     A                                      OVERLAY
     A  25                                  SFLDSP
     A  26                                  SFLDSPCTL
     A  27                                  SFLCLR
     A  28                                  SFLEND(*MORE)
     A                                  1  3'USER: MANAGER'
     A                                      COLOR(WHT)
     A                                  2  3'TEAM:'
     A                                      COLOR(WHT)
     A                                  1 25'Employee Leave Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 31'Approve/Deny Leaves'
     A                                      COLOR(YLW)
     A                                  1 65'DATE:'
     A                                      COLOR(WHT)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 65'TIME:'
     A                                      COLOR(WHT)
     A                                  2 72TIME
     A                                  4  3'Type options, press Enter.'
     A                                      COLOR(BLU)
     A                                  6  5'1=Approve'
     A                                      COLOR(BLU)
     A                                  6 17'2=Deny'
     A                                      COLOR(BLU)
     A                                  6 26'5=Description'
     A                                      COLOR(BLU)
     A                                  8  3'OPT'
     A                                      COLOR(WHT)
     A                                  8  8'ID'
     A                                      COLOR(WHT)
     A                                  8 20'Name'
     A                                      COLOR(WHT)
     A                                  8 35'From Date'
     A                                      COLOR(WHT)
     A                                  8 45'To Date'
     A                                      COLOR(WHT)
     A                                  8 54'Total Days'
     A                                      COLOR(WHT)
     A                                  8 73'Status'
     A                                      COLOR(WHT)
     A                                  8 65'LVETYP'
     A                                      COLOR(WHT)
     A          R ARLVFOOTER
     A*%%TS  SD  20260128  172319  SREERAMC    REL-V7R5M0  5770-WDS
     A                                 23  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 14'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 28'F12=Cancel'
     A                                      COLOR(BLU)
     A            MSG           50   O 24  3COLOR(RED)
